basicCase/system/controlDict
/*--------------------------------*- C++ -*-------------engine:jinja2---------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs (
    "libOpenFOAM.so"
    "libsimpleSwakFunctionObjects.so"
    "libswakFunctionObjects.so"
    "libgroovyBC.so"
    "libdynamicSmagorinsky.so"
    "libsampling.so"
   );

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         250;

deltaT          0.005;

writeControl    timeStep;

writeInterval   200.0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;


  adjustTimeStep            yes;
  maxCo               0.4;
  maxDeltaT       0.5;


functions
{
    
    // Calculating extra fields and some 
    // #include "FOCf"
    #include "FOlambda2"
    #include "FOQ"
    //#include "FOstrainRate"
    #include "FOwallShearStress"
    #include "FOyPlus"
    #include "FOReTau"
    
    
    
    // Calculating some averages
    #include "FOmeanFields"

    // Continuous sampling functions
    // #include "samplePoints"
     
}


// ************************************************************************* //