basicCase/0.orig/U
/*--------------------------------*- C++ -*-------engine:jinja2----------------------*\

| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

 
#include "$FOAM_CASE/constant/fieldData/0.000/U"


boundaryField
{
    
        inlet
        {
            type            cyclic;
        }
        
        outlet
        {
            type            cyclic;
        }
    
    

    
        "(bottom|top)"
        {
            type            noSlip;
        }
    

    "(left|right)"
    {
        type            cyclic;
    }
}


// ************************************************************************* //


