basicCase/0.orig/nut.template
/*--------------------------------*- C++ -*--------engine:jinja2--------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    {% if case=="spatial"%}
        "(inlet|outlet)"
        {
            type            calculated;
            value           uniform 1e-08;
        }
    {% elif case=="temporal"%}
        "(inlet|outlet)"
        {
            type            cyclic;
        }
    {% endif %}
    

    "(bottom|top)"
    {
        type            zeroGradient;
    }

    "(left|right)"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
