basicCase/system/fvOptions.template
/*--------------------------------*- C++ -*----------engine:jinja2------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


momentumSource
{
    type            meanVelocityForce;
    fields          (U);
    selectionMode   all;       // Apply to all cells (or use "cellZone" / "cellSet")
  
    Ubar            ({{2/3*Ucl}} 0 0);   // Target mean velocity (e.g., 5 m/s in x-direction)

}
